In [2]:
import pandas as pd
cabdata=pd.read_excel('Cab_Data.xlsx')

In [3]:
cabdata.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [4]:
cabdata.columns
#primary key is Transaction ID similar to Transaction ID data, City column is similar to city data column city

Index(['Transaction ID', 'Date of Travel', 'Company', 'City', 'KM Travelled',
       'Price Charged', 'Cost of Trip'],
      dtype='object')

In [5]:
cabdata.index

RangeIndex(start=0, stop=359392, step=1)

In [6]:
cabdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  int64
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 19.2+ MB

In [7]:
#Field/feature transformations
cabdata.groupby('City')["KM Travelled"].transform ('sum')

0         168643.76
1         168643.76
2         168643.76
3         168643.76
4         168643.76
            ...
359387    989037.66
359388    989037.66
359389    989037.66
359390    989037.66
359391    989037.66
Name: KM Travelled, Length: 359392, dtype: float64

In [8]:
cabdata["KM_Total"] = cabdata.groupby('City')["KM Travelled"].transform('sum')

In [9]:
cabdata.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,KM_Total
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635,168643.76
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854,168643.76
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632,168643.76
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602,168643.76
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776,168643.76